print("=====리스트=====")
list1 = [1, 2, 3]
for i in range(len(list1)):
    print(id(list1[i]))

print("=====딕셔너리=====")
dic = {1: 4, 2: 5, 3: 6}
for i in dic:
    print(id(dic[i]))

print("=====튜플=====")
tup = [1, 2, 3]
for i in range(len(tup)):
    print(id(tup[i]))
    
'''
1차
=====리스트=====
140736162170544  #1
140736162170576  #2
140736162170608  #3
=====딕셔너리=====
140736162170640  #4
140736162170672  #5
140736162170704  #6
=====튜플=====
140736162170544  #1
140736162170576  #2
140736162170608  #3
'''
### 파이썬은 물리적이 아닌 개념적 순서로 저장된댔는데,
### 왜 순서대로 저장되는 것 같지? 32씩 차이남.
### 책의 예제는 문자로 된 리스트였는데.

'''
PC 재시작 후
=====리스트=====
140736475563696
140736475563728
140736475563760
=====딕셔너리=====
140736475563792
140736475563824
140736475563856
=====튜플=====
140736475563696
140736475563728
140736475563760
'''

## 근데 왜 리스트의 1과 튜플의 1의 id 값이 똑같지?